CSI API ETABS v1
cAnalyze.CreateAnalysisModel Method
 Creates the analysis model. If the analysis model is already created and current, nothing is done.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int CreateAnalysisModel()
Function CreateAnalysisModel As Integer
Dim instance As cAnalyze
Dim returnValue As Integer
returnValue = instance.CreateAnalysisModel()
int CreateAnalysisModel()
abstract CreateAnalysisModel : unit -> int
Return Value
Type: Int32
 Returns zero if the analysis model is successfully created or it already exists and is current, otherwise it returns a nonzero value.
Remarks
 It is not necessary to call this function before running an analysis. The analysis model is automatically created, if necessary, when the model is run.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'create the analysis model
       ret = SapModel.Analyze.CreateAnalysisModel
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace